# GetLayerElevation

## Description
Gets the elevation and thickness of the specified layer.

```pascal
PROCEDURE GetLayerElevation(
				h             : HANDLE;
				VAR baseElev  : REAL;
				VAR thickness : REAL);
```

```python

def vs.GetLayerElevation(h):
    return (baseElev, thickness)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to the layer|
|baseElev|REAL|Base elevation of the layer|
|thickness|REAL|Thickness of the layer|

## Examples
```pascal
PROCEDURE Example;

VAR

	h :HANDLE;

	baseElev, thickness :REAL;

BEGIN

	h := FLayer;

	WHILE h &lt;&gt; NIL DO BEGIN

		GetLayerElevation(h, baseElev, thickness);

		thickness := thickness / (25.4 / GetPrefReal(152));

		AlrtDialog(Concat('layer name: ', GetLName(h), ', baseElev: ', baseElev, ', thickness: ', thickness));

		h := NextLayer(h);

	END;

END;

RUN(Example);
```

## See Also
VS Functions:
SetLayerElevation

## Version
Availability: from VectorWorks10.0
## Category
* Layers